app/views/events/index.html.erb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."event_id" = ?  [["event_id", 1]]
---
          <div class="panel-body">
            <% event.tasks.each do |task| %>