app/views/calendars/_events.html.erb

SELECT "events".* FROM "events"
---

<% Event.all.each do |event| %>

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."event_id" = ?  [["event_id", 1]]
---
          <div class="panel-body">
            <% event.tasks.each do |task| %>