app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT  "calendars".* FROM "calendars"   ORDER BY "calendars"."id" ASC LIMIT 1

  def edit
    unless params[:status].nil?
      if params[:status].length == 4
          str = params[:status].byteslice(0,2)
        else
          str = params[:status].byteslice(0,1)
        end
      if params[:status].match(/_m/)
        @calendar.update_attribute(:month, str)
---
UPDATE "calendars" SET "month" = ?, "updated_at" = ? WHERE "calendars"."id" = 1  [["month", "10"], ["updated_at", "2015-09-15 15:00:51.925318"]]

    def set_calendar
      @calendar = Calendar.find(params[:id])
---
SELECT  "calendars".* FROM "calendars"  WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]