app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "endDate", "endDateTime", "endTimeUnspecified", "startDate", "startDateTime", "summary", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save