app/controllers/omniauth_callbacks_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'serenasyue@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["sign_in_count", 1], ["updated_at", "2015-09-16 13:48:47.876178"]]
---
  def google_oauth2
      # You need to implement the method below in your model (e.g. app/models/user.rb)
      @user = User.from_omniauth(request.env["omniauth.auth"])
      exists_user = User.find_by(email: @user.email)
      if @user.persisted?
        if @user.sign_in_count == 0
          import_events(request.env["omniauth.auth"])
        end
        @user.sign_in_count = @user.sign_in_count + 1
        @user.save