app/controllers/tasks_controller.rb

UPDATE "tasks" SET "is_complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 5  [["is_complete", "t"], ["updated_at", "2015-09-15 13:00:19.492660"]]
---
  def edit
    unless params[:status].nil?
      if params[:status] == 'completed'
        @task.update_attribute(:is_complete, true)

SELECT  "calendars".* FROM "calendars"   ORDER BY "calendars"."id" ASC LIMIT 1
SELECT "tasks".* FROM "tasks"
INSERT INTO "tasks" ("created_at", "end_date", "end_time", "event_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-09-16 02:27:20.032184"], ["end_date", "2015-09-16"], ["end_time", "2015-09-15"], ["event_id", 1], ["name", "1"], ["updated_at", "2015-09-16 02:27:20.032184"]]
---
  def create
    @task = Task.new(task_params)
    @task.end_time = Date.civil(Calendar.first.year.to_i, Calendar.first.month.to_i, Calendar.first.day.to_i)
    @task.save!

UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["name", "s"], ["updated_at", "2015-09-15 12:46:16.999962"]]
---
  def update
    if @task.update_attributes(task_params)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_tasks
      @task = Task.find(params[:id])